---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.ConceptualConstructionFloorSlabType.InvalidFloorSlabTypeConstruction
enum: Autodesk.Revit.DB.Analysis.ConceptualConstructionFloorSlabType
source: html/82690260-73b8-b923-99e0-ef6f66a0eb66.htm
---
# Autodesk.Revit.DB.Analysis.ConceptualConstructionFloorSlabType.InvalidFloorSlabTypeConstruction

Invalid/not set Floor or Slab Type construction value